app/views/projects/_form.html.erb

        <div>
          <%= check_box_tag "project[category_ids][]", category.id, @project.categories.include?(category) %>
---
SELECT "categories".* FROM "categories"
SELECT 1 AS one FROM "categories" INNER JOIN "categories_projects" ON "categories"."id" = "categories_projects"."category_id" WHERE "categories_projects"."project_id" IS NULL AND "categories"."id" = 1 LIMIT 1