app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("all_students_presenting", "class_affiliation", "contact_email", "contact_name", "created_at", "presentation_title", "project_description", "special_needs", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save